ERM/src/DataProcessors/ПереносБалансовСLawsonНаOracleMI/ПереносБалансовСLawsonНаOracleMI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПереносБалансовСLawsonНаOracleMI</name>
</mdclass:DataProcessor>

ERM/src/InformationRegisters/ВнутренниеКурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеКурсыВалют</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Documents/ТранзакцияOracle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ТранзакцияOracle</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GlSourceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OracleGlSourceType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Comment>Код операционной единицы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GL_Account</Name>
					<Comment>Счет ГК</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SONum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SODate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShipDateActual</Name>
					<Comment>Дата отгрузки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Дата создание операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Comment>ID пользователя</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocID</Name>
					<Comment>ID документа. В данном случае ID транзакции Дебиторов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LineID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocNumber2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocTransID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvDate</Name>
					<Comment>Дата СФ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalTrxNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/DataProcessors/ПереносБалансовСLawsonНаOracleMI/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НайтиТранзакцииLawson(Дата, ВидСчета, ManagementGeomarket) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док_ПроводкаDSS.Ссылка КАК ТранзакцияLawson,
		|	Док_ПроводкаDSS.TranAmount КАК Amount,
		|	Док_ПроводкаDSS.КонтрагентLawson КАК Client,
		|	ВЫБОР
		|		КОГДА ВнутренниеКурсыВалютСрезПоследних.Курс ЕСТЬ NULL
		|				ИЛИ ВнутренниеКурсыВалютСрезПоследних.Курс = 0
		|			ТОГДА 0
		|		ИНАЧЕ Док_ПроводкаDSS.TranAmount / ВнутренниеКурсыВалютСрезПоследних.Курс
		|	КОНЕЦ КАК BaseAmount,
		//|	Док_ПроводкаDSS.BaseAmount КАК BaseAmount,
		//|	Док_ПроводкаDSS.Номер КАК Номер,
		//|	Док_ПроводкаDSS.SourceCode КАК SourceCode,
		//|	Док_ПроводкаDSS.AccountLawson КАК AccountLawson,
		//|	Док_ПроводкаDSS.AU КАК AU,
		//|	Док_ПроводкаDSS.AU.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket КАК Geo,
		//|	Док_ПроводкаDSS.Description КАК Description,
		|	Док_ПроводкаDSS.Currency КАК Currency,
		|	Док_ПроводкаDSS.AU.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket.ManagementGeomarket КАК ManagementGeomarket
		//|	Док_ПроводкаDSS.Company КАК Company,
		//|	Док_ПроводкаDSS.CustomerNumber КАК CustomerNumber,
		//|	Док_ПроводкаDSS.КонтрагентLawson КАК КонтрагентLawson,
		//|	Док_ПроводкаDSS.AccountingPeriod КАК AccountingPeriod,
		//|	NULL КАК Account,
		//|	NULL КАК Client,
		//|	NULL КАК DocID,
		//|	NULL КАК DocNumber,
		//|	NULL КАК GL_Account,
		//|	NULL КАК GlSourceType
		|ИЗ
		|	Документ.ПроводкаDSS КАК Док_ПроводкаDSS
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеКурсыВалют.СрезПоследних(&КонецПериода, ) КАК ВнутренниеКурсыВалютСрезПоследних
		|		ПО Док_ПроводкаDSS.Currency = ВнутренниеКурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	(Док_ПроводкаDSS.AccountLawson = &AccountLawson1
		|			ИЛИ Док_ПроводкаDSS.AccountLawson = &AccountLawson2)
		|	И Док_ПроводкаDSS.AU.Сегмент.БазовыйЭлемент.Родитель = &SubSegmentLawson
		|	И Док_ПроводкаDSS.Проведен
		|	И (&ManagementGeomarket = ЗНАЧЕНИЕ(Справочник.ManagementGeography.ПустаяСсылка)
		|			ИЛИ Док_ПроводкаDSS.AU.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket.ManagementGeomarket = &ManagementGeomarket)
		|	И Док_ПроводкаDSS.AccountingPeriod >= &НачалоПериода
		|	&УсловиеСчета
		|	И Док_ПроводкаDSS.AccountingPeriod <= &КонецПериода";
	
	Запрос.УстановитьПараметр("AccountLawson1", ПланыСчетов.Lawson.TradeReceivables);
	Запрос.УстановитьПараметр("AccountLawson2", ПланыСчетов.Lawson.RevenueEstsUnbilled);
	Запрос.УстановитьПараметр("SubSegmentLawson", Справочники.HFM_Technology.НайтиПоКоду("ABL"));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ManagementGeomarket", ManagementGeomarket);
	
	Если ВидСчета = "Billed" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И Док_ПроводкаDSS.AccountLawson.БазовыйЭлемент.Код = ""12001""");
	ИначеЕсли ВидСчета = "Unbilled" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И НЕ Док_ПроводкаDSS.AccountLawson.БазовыйЭлемент.Код = ""12001""");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция НайтиТранзакцииOracle(Дата, ВидСчета, ManagementGeomarket) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранзакцияOracle.Ссылка КАК ТранзакцияOracle,
		|	ТранзакцияOracle.AU.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket.ManagementGeomarket КАК ManagementGeomarket,
		|	ТранзакцияOracle.Currency КАК Currency,
		|	ТранзакцияOracle.Client,
		|	ВЫБОР
		|		КОГДА ТранзакцияOracle.Account.Код ПОДОБНО ""110G.%""
		|			ТОГДА ТранзакцияOracle.Amount * 1.18
		|		ИНАЧЕ ТранзакцияOracle.Amount
		|	КОНЕЦ КАК Amount,
		|	ВЫБОР
		|		КОГДА ВнутренниеКурсыВалютСрезПоследних.Курс ЕСТЬ NULL
		|				ИЛИ ВнутренниеКурсыВалютСрезПоследних.Курс = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТранзакцияOracle.Account.Код ПОДОБНО ""110G.%""
		|					ТОГДА ТранзакцияOracle.Amount * 1.18
		|				ИНАЧЕ ТранзакцияOracle.Amount
		|			КОНЕЦ / ВнутренниеКурсыВалютСрезПоследних.Курс
		|	КОНЕЦ КАК BaseAmount
		|ИЗ
		|	Документ.ТранзакцияOracle КАК ТранзакцияOracle
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеКурсыВалют.СрезПоследних(&КонецПериода, ) КАК ВнутренниеКурсыВалютСрезПоследних
		|		ПО ТранзакцияOracle.Currency = ВнутренниеКурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	ТранзакцияOracle.Проведен
		|	И (ТранзакцияOracle.Account.Код ПОДОБНО ""110G%""
		|			ИЛИ ТранзакцияOracle.Account.Код ПОДОБНО ""1090%"")
		|	И ТранзакцияOracle.GL_Account ПОДОБНО ""%.999999""
		|	И ТранзакцияOracle.Дата >= &НачалоПериода
		|	И ТранзакцияOracle.Дата <= &КонецПериода
		|	И (&ManagementGeomarket = ЗНАЧЕНИЕ(Справочник.ManagementGeography.ПустаяСсылка)
		|			ИЛИ ТранзакцияOracle.AU.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket.ManagementGeomarket = &ManagementGeomarket)
		|	&УсловиеСчета
		|	И ТранзакцияOracle.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ManagementGeomarket", ManagementGeomarket);
	
	Если ВидСчета = "Billed" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И ТранзакцияOracle.Account.БазовыйЭлемент.Код = ""12001""");
	ИначеЕсли ВидСчета = "Unbilled" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И НЕ ТранзакцияOracle.Account.БазовыйЭлемент.Код = ""12001""");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецЕсли
